#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.iam-role-for-lambda.aws_iam_role.this: Refreshing state... [id=LambdaRole]
module.s3-website.aws_s3_bucket.static_site: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.iam-role-for-lambda.aws_iam_role_policy.sns_and_ses[0]: Refreshing state... [id=LambdaRole:sns_and_ses]
module.iam-role-for-lambda.aws_iam_role_policy.cloudwatchlogs[0]: Refreshing state... [id=LambdaRole:cloudwatchlogs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3-website.aws_s3_bucket_policy.static_site_policy will be created
  + resource "aws_s3_bucket_policy" "static_site_policy" {
      + bucket = "dubovsky-andrey-website-bucket"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::dubovsky-andrey-website-bucket/*"
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3-website.aws_s3_bucket_public_access_block.static_site_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "static_site_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "dubovsky-andrey-website-bucket"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3-website.aws_s3_bucket_website_configuration.static_site_website will be created
  + resource "aws_s3_bucket_website_configuration" "static_site_website" {
      + bucket           = "dubovsky-andrey-website-bucket"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "environment" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "project" but a value was
found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dubovsky-Andrey, Action: `pull_request`*